perf/exchange-volume2.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5

scenarios:
  - name: Small (23 USD)
    weight: 80
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 10

  - name: High (1500 USD)
    weight: 15
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 1000

  - name: Spike (10000 USD)
    weight: 5
    flow:
      - post:
          url: '/exchange'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 6000