perf/exchange-volume4.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50

  phases:
    - name: Ramp
      duration: 20
      arrivalRate: 1
      rampTo: 4
    - name: Plain
      duration: 40
      arrivalRate: 4

scenarios:
  - name: Exchange all currency pairs (one of each)
    flow:
      # BRL -> ARS
      - post:
          url: '/exchange'
          json:
            baseCurrency: "BRL"
            counterCurrency: "ARS"
            baseAccountId: 4
            counterAccountId: 1
            baseAmount: 50

      # EUR -> ARS
      - post:
          url: '/exchange'
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAccountId: 3
            counterAccountId: 1
            baseAmount: 15

      # USD -> ARS
      - post:
          url: '/exchange'
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAccountId: 2
            counterAccountId: 1
            baseAmount: 10

      # ARS -> BRL
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "BRL"
            baseAccountId: 1
            counterAccountId: 4
            baseAmount: 3000

      # ARS -> EUR
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "EUR"
            baseAccountId: 1
            counterAccountId: 3
            baseAmount: 2000

      # ARS -> USD
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 1000