perf/peak-load.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Peak load
      duration: 40        # 15 segundos de pico
      arrivalRate: 600     # 750 usuarios/seg
    - name: Ramp-down
      duration: 30
      arrivalRate: 10
      rampTo: 5           # baja gradualmente a 5 usuarios/seg
    - name: Steady
      duration: 60
      arrivalRate: 5      # flujo normal

scenarios:

  - name: Exchange transaction
    weight: 3
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 1.0
            baseAccountId: 2
            counterAccountId: 1

  - name: Rates PUT (/rates)
    weight: 1             # ponderación
    flow:
      - put:
          url: '/rates'
          json:
            baseCurrency: "USD"
            counterCurrency: "EUR"
            rate: 0.85

  - name: Get Rates (/rates)
    weight: 3
    flow:
      - get:
          url: '/rates'