perf/stress-test.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp-up
      duration: 30        # 30 segundos para llegar al pico
      arrivalRate: 50     # empieza con 10 usuarios/seg
      rampTo: 650         # sube gradualmente hasta 600 usuarios/seg

    - name: Peak load
      duration: 40        # mantiene el pico
      arrivalRate: 650

    - name: Ramp-down
      duration: 30
      arrivalRate: 650
      rampTo: 5           # baja gradualmente a 5 usuarios/seg

    - name: Steady
      duration: 60
      arrivalRate: 50      # flujo normal

scenarios:

  - name: Rates PUT (/rates)
    weight: 1             # ponderación
    flow:
      - put:
          url: '/rates'
          json:
            baseCurrency: "USD"
            counterCurrency: "EUR"
            rate: 0.85

  - name: Get Rates (/rates)
    weight: 10
    flow:
      - get:
          url: '/rates'